menu = (5000, 5500, 13000)
sum = 0
print("\
==========메뉴==========\n\
0 : 주문종료 \n\
1 : 짜장면 \t5000원\n\
2 : 짬뽕 \t5500원\n\
3 : 탕수육 \t13000원\n\
========================\n")

while(True) :
    select = int(input("번호를 입력하세요 : "))

    if select == 0:
        break
    elif select > 3:
        print("없는 번호입니다. 다시 입력하세요. \n")
    else:
        sum += menu[select-1]
        print("주문 접수 되었습니다.\n\
---------------------")

print("\n\n\n\
======================\n\
프로그램을 종료합니다\n\
총액은 " + str(sum) + "원 입니다.\n\
======================")